Revit 2027 API
PanelScheduleData.PhaseLoadType Property
 This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelSchedulePhaseLoadType PhaseLoadType { get; }
Public ReadOnly Property PhaseLoadType As PanelSchedulePhaseLoadType
	Get
public:
property PanelSchedulePhaseLoadType PhaseLoadType {
	PanelSchedulePhaseLoadType get ();
}
member PhaseLoadType : PanelSchedulePhaseLoadType with get
Property Value
PanelSchedulePhaseLoadType
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace